app/controllers/application_controller.rb

    def get_current_user
        id = decode_token
        User.find_by(id: id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]