app/controllers/baskets_controller.rb

SELECT "baskets".* FROM "baskets"
---
    def index
      baskets = Basket.all

INSERT INTO "baskets" ("customer_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["customer_id", 2], ["created_at", "2023-05-01 10:38:07.066776"], ["updated_at", "2023-05-01 10:38:07.066776"]]
SELECT "baskets".* FROM "baskets" WHERE "baskets"."customer_id" = $1 LIMIT $2  [["customer_id", 2], ["LIMIT", 1]]
---
    def create
      basket = Basket.find_or_create_by(customer_id: params[:customer_id])