app/controllers/basket_products_controller.rb

SELECT "basket_products".* FROM "basket_products" WHERE "basket_products"."product_id" = $1 AND "basket_products"."basket_id" = $2 LIMIT $3  [["product_id", 5], ["basket_id", 1], ["LIMIT", 1]]
DELETE FROM "basket_products" WHERE "basket_products"."id" = $1  [["id", 1]]
---
    def remove
      basket_product = BasketProduct.find_by(product_id: params[:product_id], basket_id: params[:basket_id])
      if basket_product
        basket_product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
    def show
      basket_product = BasketProduct.find_by(id: params[:id])

INSERT INTO "basket_products" ("basket_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["basket_id", 1], ["product_id", 30], ["created_at", "2023-05-01 10:38:41.114667"], ["updated_at", "2023-05-01 10:38:41.114667"]]
---
    def create
      basket_product = BasketProduct.create(product_id: params[:product_id], basket_id: params[:basket_id])