app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
        categories = Category.all

        render json: categories.map(&:name).uniq

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def show
        category = Category.find_by(id: params[:id])