app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
    def index
      customers = Customer.all

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      customer = Customer.find_by(id: params[:id])