app/controllers/farmers_controller.rb

  def show
    render json: Farmer.find_by(id: params[:id]), serializer: FarmerSerializer
---
SELECT "farmers".* FROM "farmers" WHERE "farmers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]