app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Vegetable"], ["LIMIT", 1]]
INSERT INTO "products" ("name", "price", "quantity", "url_img", "farmer_id", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create

      product = Product.new(name: params[:name], price: params[:price], quantity: params[:quantity], url_img: params[:url_img], farmer_id: params[:farmer_id])

      product.category = Category.find_by(name: params[:category])
      product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 38]]
---
    def destroy
      product = Product.find_by(id: params[:id])
      if product
        product.destroy

SELECT "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Animal Products"], ["LIMIT", 1]]
INSERT INTO "products" ("name", "price", "quantity", "farmer_id", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Eggs"], ["price", 15.0], ["quantity", "1 egg"], ["farmer_id", 3], ["created_at", "2023-05-03 04:02:29.552677"], ["updated_at", "2023-05-03 04:02:29.552677"], ["category_id", 2]]
---
  def create

    product = Product.new(name: params[:name], price: params[:price], quantity: params[:quantity], url_img: params[:url_img], farmer_id: params[:farmer_id])

    product.category = Category.find_by(name: params[:category])
    product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 42]]
---
  def destroy
    product = Product.find_by(id: params[:id])
    if product
      product.destroy