app/controllers/users_controller.rb

    def signin
      # find user then authenticate
      user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sam@mail.com"], ["LIMIT", 1]]

    def signup
      # find user then authenticate
      user = User.create(email: params[:email], password: params[:password], first_name: params[:first_name],
      last_name: params[:last_name], address: params[:address], phone: params[:phone])

      user.define_user_type(params[:user_type], user.id)

      user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "first_name", "last_name", "address", "phone") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "updated_at" = $1, "customer_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-04-30 23:28:21.969416"], ["customer_id", 2], ["id", 5]]