app/models/user.rb

INSERT INTO "farmers" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2023-05-01 20:07:41.324656"], ["updated_at", "2023-05-01 20:07:41.324656"], ["user_id", 21]]
INSERT INTO "customers" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2023-04-30 23:28:21.956953"], ["updated_at", "2023-04-30 23:28:21.956953"], ["user_id", 5]]
---
def define_user_type (user_type, id)
    if user_type == 'farmer'
        farmer = Farmer.create(user_id: id)
        self.farmer_id = farmer.id
        farmer.save

    elsif user_type == 'customer'
        customer = Customer.create(user_id: id)